; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-5-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	s15 - location
	p0-14 - location
	p1-5 - location
	p1-7 - location
	p1-13 - location
	p1-15 - location
	p2-1 - location
	p2-5 - location
	p2-6 - location
	p2-10 - location
	p2-12 - location
	p2-13 - location
	p2-14 - location
	p2-15 - location
	p3-13 - location
	p3-14 - location
	p4-14 - location
	p5-0 - location
	p5-15 - location
	p6-11 - location
	p7-1 - location
	p7-8 - location
	p8-9 - location
	p9-4 - location
	p9-7 - location
	p9-12 - location
	p9-14 - location
	p10-6 - location
	p11-0 - location
	p12-3 - location
	p13-4 - location
	p14-15 - location
	p15-4 - location
	)
	(:init
	(at driver1 s10)
	(at driver2 s13)
	(at driver3 s10)
	(at driver4 s9)
	(at driver5 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s8)
	(empty truck2)
	(at truck3 s12)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s10)
	(empty truck5)
	(at package1 s12)
	(at package2 s14)
	(at package3 s3)
	(at package4 s6)
	(at package5 s2)
	(at package6 s1)
	(at package7 s0)
	(at package8 s12)
	(at package9 s12)
	(at package10 s5)
	(at package11 s1)
	(at package12 s9)
	(at package13 s2)
	(at package14 s15)
	(at package15 s14)
	(path s0 p0-14)
	(path p0-14 s0)
	(path s14 p0-14)
	(path p0-14 s14)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s1 p1-13)
	(path p1-13 s1)
	(path s13 p1-13)
	(path p1-13 s13)
	(path s1 p1-15)
	(path p1-15 s1)
	(path s15 p1-15)
	(path p1-15 s15)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-10)
	(path p2-10 s2)
	(path s10 p2-10)
	(path p2-10 s10)
	(path s2 p2-12)
	(path p2-12 s2)
	(path s12 p2-12)
	(path p2-12 s12)
	(path s2 p2-13)
	(path p2-13 s2)
	(path s13 p2-13)
	(path p2-13 s13)
	(path s2 p2-14)
	(path p2-14 s2)
	(path s14 p2-14)
	(path p2-14 s14)
	(path s2 p2-15)
	(path p2-15 s2)
	(path s15 p2-15)
	(path p2-15 s15)
	(path s3 p3-13)
	(path p3-13 s3)
	(path s13 p3-13)
	(path p3-13 s13)
	(path s3 p3-14)
	(path p3-14 s3)
	(path s14 p3-14)
	(path p3-14 s14)
	(path s4 p4-14)
	(path p4-14 s4)
	(path s14 p4-14)
	(path p4-14 s14)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-15)
	(path p5-15 s5)
	(path s15 p5-15)
	(path p5-15 s15)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(path s9 p9-7)
	(path p9-7 s9)
	(path s7 p9-7)
	(path p9-7 s7)
	(path s9 p9-12)
	(path p9-12 s9)
	(path s12 p9-12)
	(path p9-12 s12)
	(path s9 p9-14)
	(path p9-14 s9)
	(path s14 p9-14)
	(path p9-14 s14)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(path s11 p11-0)
	(path p11-0 s11)
	(path s0 p11-0)
	(path p11-0 s0)
	(path s12 p12-3)
	(path p12-3 s12)
	(path s3 p12-3)
	(path p12-3 s3)
	(path s13 p13-4)
	(path p13-4 s13)
	(path s4 p13-4)
	(path p13-4 s4)
	(path s14 p14-15)
	(path p14-15 s14)
	(path s15 p14-15)
	(path p14-15 s15)
	(path s15 p15-4)
	(path p15-4 s15)
	(path s4 p15-4)
	(path p15-4 s4)
	(link s0 s3)
	(link s3 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s10)
	(link s10 s0)
	(link s0 s15)
	(link s15 s0)
	(link s1 s13)
	(link s13 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s6)
	(link s6 s2)
	(link s2 s7)
	(link s7 s2)
	(link s2 s9)
	(link s9 s2)
	(link s2 s15)
	(link s15 s2)
	(link s3 s5)
	(link s5 s3)
	(link s3 s11)
	(link s11 s3)
	(link s3 s12)
	(link s12 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s9)
	(link s9 s4)
	(link s4 s14)
	(link s14 s4)
	(link s4 s15)
	(link s15 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s4)
	(link s4 s5)
	(link s5 s12)
	(link s12 s5)
	(link s6 s14)
	(link s14 s6)
	(link s7 s4)
	(link s4 s7)
	(link s7 s15)
	(link s15 s7)
	(link s8 s4)
	(link s4 s8)
	(link s8 s9)
	(link s9 s8)
	(link s8 s13)
	(link s13 s8)
	(link s8 s14)
	(link s14 s8)
	(link s9 s1)
	(link s1 s9)
	(link s9 s5)
	(link s5 s9)
	(link s10 s1)
	(link s1 s10)
	(link s10 s3)
	(link s3 s10)
	(link s10 s8)
	(link s8 s10)
	(link s10 s14)
	(link s14 s10)
	(link s11 s2)
	(link s2 s11)
	(link s11 s8)
	(link s8 s11)
	(link s11 s10)
	(link s10 s11)
	(link s11 s15)
	(link s15 s11)
	(link s12 s4)
	(link s4 s12)
	(link s12 s10)
	(link s10 s12)
	(link s12 s13)
	(link s13 s12)
	(link s12 s15)
	(link s15 s12)
	(link s13 s3)
	(link s3 s13)
	(link s13 s15)
	(link s15 s13)
	(link s14 s5)
	(link s5 s14)
	(link s14 s11)
	(link s11 s14)
	(link s14 s13)
	(link s13 s14)
	(link s15 s3)
	(link s3 s15)
)
	(:goal (and
	(at driver2 s1)
	(at driver4 s1)
	(at driver5 s15)
	(at truck1 s14)
	(at truck2 s1)
	(at truck3 s5)
	(at truck4 s8)
	(at truck5 s6)
	(at package1 s1)
	(at package2 s15)
	(at package3 s10)
	(at package4 s3)
	(at package5 s6)
	(at package6 s8)
	(at package7 s0)
	(at package8 s13)
	(at package9 s1)
	(at package10 s11)
	(at package11 s8)
	(at package12 s6)
	(at package13 s10)
	(at package14 s1)
	(at package15 s4)
	))

)

; plan
1. (load-truck package8 truck3 s12)
   deleted: (at package8 s12)
   added: (in package8 truck3)
   goals met: 1 of 23
2. (load-truck package3 truck4 s3)
   deleted: (at package3 s3)
   added: (in package3 truck4)
   goals met: 1 of 23
3. (walk driver2 s13 p3-13)
   deleted: (at driver2 s13)
   added: (at driver2 p3-13)
   goals met: 1 of 23
4. (walk driver4 s9 p9-12)
   deleted: (at driver4 s9)
   added: (at driver4 p9-12)
   goals met: 1 of 23
5. (board-truck driver5 truck1 s2)
   deleted: (at driver5 s2) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 1 of 23
6. (drive-truck truck1 s2 s9 driver5)
   deleted: (at truck1 s2)
   added: (at truck1 s9)
   goals met: 1 of 23
7. (load-truck package12 truck1 s9)
   deleted: (at package12 s9)
   added: (in package12 truck1)
   goals met: 1 of 23
8. (drive-truck truck1 s9 s2 driver5)
   deleted: (at truck1 s9)
   added: (at truck1 s2)
   goals met: 1 of 23
9. (walk driver2 p3-13 s3)
   deleted: (at driver2 p3-13)
   added: (at driver2 s3)
   goals met: 1 of 23
10. (walk driver4 p9-12 s12)
   deleted: (at driver4 p9-12)
   added: (at driver4 s12)
   goals met: 1 of 23
11. (board-truck driver3 truck5 s10)
   deleted: (at driver3 s10) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 1 of 23
12. (drive-truck truck5 s10 s11 driver3)
   deleted: (at truck5 s10)
   added: (at truck5 s11)
   goals met: 1 of 23
13. (drive-truck truck5 s11 s2 driver3)
   deleted: (at truck5 s11)
   added: (at truck5 s2)
   goals met: 1 of 23
14. (load-truck package13 truck5 s2)
   deleted: (at package13 s2)
   added: (in package13 truck5)
   goals met: 1 of 23
15. (load-truck package5 truck5 s2)
   deleted: (at package5 s2)
   added: (in package5 truck5)
   goals met: 1 of 23
16. (drive-truck truck1 s2 s6 driver5)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 1 of 23
17. (unload-truck package12 truck1 s6)
   deleted: (in package12 truck1)
   added: (at package12 s6)
   goals met: 2 of 23
18. (load-truck package4 truck1 s6)
   deleted: (at package4 s6)
   added: (in package4 truck1)
   goals met: 2 of 23
19. (drive-truck truck1 s6 s14 driver5)
   deleted: (at truck1 s6)
   added: (at truck1 s14)
   goals met: 3 of 23
20. (board-truck driver2 truck4 s3)
   deleted: (at driver2 s3) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 3 of 23
21. (board-truck driver4 truck3 s12)
   deleted: (at driver4 s12) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 3 of 23
22. (drive-truck truck3 s12 s13 driver4)
   deleted: (at truck3 s12)
   added: (at truck3 s13)
   goals met: 3 of 23
23. (drive-truck truck4 s3 s10 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s10)
   goals met: 3 of 23
24. (drive-truck truck5 s2 s11 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s11)
   goals met: 3 of 23
25. (drive-truck truck5 s11 s10 driver3)
   deleted: (at truck5 s11)
   added: (at truck5 s10)
   goals met: 3 of 23
26. (unload-truck package13 truck5 s10)
   deleted: (in package13 truck5)
   added: (at package13 s10)
   goals met: 4 of 23
27. (load-truck package2 truck1 s14)
   deleted: (at package2 s14)
   added: (in package2 truck1)
   goals met: 4 of 23
28. (drive-truck truck5 s10 s12 driver3)
   deleted: (at truck5 s10)
   added: (at truck5 s12)
   goals met: 4 of 23
29. (load-truck package1 truck5 s12)
   deleted: (at package1 s12)
   added: (in package1 truck5)
   goals met: 4 of 23
30. (drive-truck truck5 s12 s4 driver3)
   deleted: (at truck5 s12)
   added: (at truck5 s4)
   goals met: 4 of 23
31. (drive-truck truck5 s4 s1 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   goals met: 4 of 23
32. (unload-truck package1 truck5 s1)
   deleted: (in package1 truck5)
   added: (at package1 s1)
   goals met: 5 of 23
33. (drive-truck truck1 s14 s11 driver5)
   deleted: (at truck1 s14)
   added: (at truck1 s11)
   goals met: 4 of 23
34. (unload-truck package8 truck3 s13)
   deleted: (in package8 truck3)
   added: (at package8 s13)
   goals met: 5 of 23
35. (unload-truck package3 truck4 s10)
   deleted: (in package3 truck4)
   added: (at package3 s10)
   goals met: 6 of 23
36. (drive-truck truck4 s10 s12 driver2)
   deleted: (at truck4 s10)
   added: (at truck4 s12)
   goals met: 6 of 23
37. (drive-truck truck3 s13 s12 driver4)
   deleted: (at truck3 s13)
   added: (at truck3 s12)
   goals met: 6 of 23
38. (drive-truck truck1 s11 s3 driver5)
   deleted: (at truck1 s11)
   added: (at truck1 s3)
   goals met: 6 of 23
39. (load-truck package9 truck4 s12)
   deleted: (at package9 s12)
   added: (in package9 truck4)
   goals met: 6 of 23
40. (drive-truck truck3 s12 s5 driver4)
   deleted: (at truck3 s12)
   added: (at truck3 s5)
   goals met: 7 of 23
41. (drive-truck truck4 s12 s15 driver2)
   deleted: (at truck4 s12)
   added: (at truck4 s15)
   goals met: 7 of 23
42. (unload-truck package4 truck1 s3)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   goals met: 8 of 23
43. (load-truck package10 truck3 s5)
   deleted: (at package10 s5)
   added: (in package10 truck3)
   goals met: 8 of 23
44. (load-truck package14 truck4 s15)
   deleted: (at package14 s15)
   added: (in package14 truck4)
   goals met: 8 of 23
45. (drive-truck truck3 s5 s3 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 7 of 23
46. (drive-truck truck4 s15 s4 driver2)
   deleted: (at truck4 s15)
   added: (at truck4 s4)
   goals met: 7 of 23
47. (load-truck package11 truck5 s1)
   deleted: (at package11 s1)
   added: (in package11 truck5)
   goals met: 7 of 23
48. (drive-truck truck3 s3 s11 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s11)
   goals met: 7 of 23
49. (drive-truck truck4 s4 s1 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 7 of 23
50. (drive-truck truck1 s3 s15 driver5)
   deleted: (at truck1 s3)
   added: (at truck1 s15)
   goals met: 7 of 23
51. (unload-truck package2 truck1 s15)
   deleted: (in package2 truck1)
   added: (at package2 s15)
   goals met: 8 of 23
52. (drive-truck truck1 s15 s4 driver5)
   deleted: (at truck1 s15)
   added: (at truck1 s4)
   goals met: 8 of 23
53. (drive-truck truck1 s4 s14 driver5)
   deleted: (at truck1 s4)
   added: (at truck1 s14)
   goals met: 9 of 23
54. (disembark-truck driver5 truck1 s14)
   deleted: (driving driver5 truck1)
   added: (at driver5 s14) (empty truck1)
   goals met: 9 of 23
55. (walk driver5 s14 p14-15)
   deleted: (at driver5 s14)
   added: (at driver5 p14-15)
   goals met: 9 of 23
56. (unload-truck package10 truck3 s11)
   deleted: (in package10 truck3)
   added: (at package10 s11)
   goals met: 10 of 23
57. (unload-truck package14 truck4 s1)
   deleted: (in package14 truck4)
   added: (at package14 s1)
   goals met: 11 of 23
58. (load-truck package6 truck4 s1)
   deleted: (at package6 s1)
   added: (in package6 truck4)
   goals met: 11 of 23
59. (unload-truck package9 truck4 s1)
   deleted: (in package9 truck4)
   added: (at package9 s1)
   goals met: 12 of 23
60. (drive-truck truck3 s11 s14 driver4)
   deleted: (at truck3 s11)
   added: (at truck3 s14)
   goals met: 12 of 23
61. (drive-truck truck4 s1 s9 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s9)
   goals met: 12 of 23
62. (drive-truck truck5 s1 s10 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s10)
   goals met: 12 of 23
63. (drive-truck truck5 s10 s8 driver3)
   deleted: (at truck5 s10)
   added: (at truck5 s8)
   goals met: 12 of 23
64. (unload-truck package11 truck5 s8)
   deleted: (in package11 truck5)
   added: (at package11 s8)
   goals met: 13 of 23
65. (drive-truck truck3 s14 s5 driver4)
   deleted: (at truck3 s14)
   added: (at truck3 s5)
   goals met: 14 of 23
66. (walk driver5 p14-15 s15)
   deleted: (at driver5 p14-15)
   added: (at driver5 s15)
   goals met: 15 of 23
67. (drive-truck truck4 s9 s8 driver2)
   deleted: (at truck4 s9)
   added: (at truck4 s8)
   goals met: 16 of 23
68. (drive-truck truck5 s8 s14 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s14)
   goals met: 16 of 23
69. (load-truck package15 truck5 s14)
   deleted: (at package15 s14)
   added: (in package15 truck5)
   goals met: 16 of 23
70. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 16 of 23
71. (walk driver4 s5 p1-5)
   deleted: (at driver4 s5)
   added: (at driver4 p1-5)
   goals met: 16 of 23
72. (unload-truck package6 truck4 s8)
   deleted: (in package6 truck4)
   added: (at package6 s8)
   goals met: 17 of 23
73. (disembark-truck driver2 truck4 s8)
   deleted: (driving driver2 truck4)
   added: (at driver2 s8) (empty truck4)
   goals met: 17 of 23
74. (board-truck driver2 truck2 s8)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 17 of 23
75. (drive-truck truck2 s8 s10 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s10)
   goals met: 17 of 23
76. (drive-truck truck5 s14 s4 driver3)
   deleted: (at truck5 s14)
   added: (at truck5 s4)
   goals met: 17 of 23
77. (unload-truck package15 truck5 s4)
   deleted: (in package15 truck5)
   added: (at package15 s4)
   goals met: 18 of 23
78. (drive-truck truck2 s10 s1 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s1)
   goals met: 19 of 23
79. (walk driver4 p1-5 s1)
   deleted: (at driver4 p1-5)
   added: (at driver4 s1)
   goals met: 20 of 23
80. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 21 of 23
81. (drive-truck truck5 s4 s14 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s14)
   goals met: 21 of 23
82. (drive-truck truck5 s14 s6 driver3)
   deleted: (at truck5 s14)
   added: (at truck5 s6)
   goals met: 22 of 23
83. (unload-truck package5 truck5 s6)
   deleted: (in package5 truck5)
   added: (at package5 s6)
   goals met: 23 of 23
